disambr.src.org
#+title: NEDR - Named Entity Disambiguation in R
#+author: Stanislav A. Vlasov
#+email: stanislav.a.vlasov@gmail.com
# ------------------------------------------------------------------------------

#+PROPERTY: header-args:R :comments link  :session

Description: file:readme.org

* Make & Deploy
#+BEGIN_SRC emacs-lisp
  ;; tangle source code
  (org-babel-tangle)
  ;; run package deployment scripts
  (let ((org-confirm-babel-evaluate nil))
	(save-excursion
	  (org-babel-goto-named-src-block "document")
	  (org-babel-execute-src-block)))
#+END_SRC
** Package documentation
:PROPERTIES:
:ID:       org:g01ja7119ri0
:END:
#+BEGIN_SRC R :tangle R/disambr.r
  #' @details
  #' This package provides a framework for disambiguating named entities (e.g., authors in large bibliometric databases)
  #' 
  #' Package provides following main functions
  #' - disambr_read - reads WoS data
  #' - disambr_aev - implementation of the AEV algorithm (van den Akker et al., 2020) for Web of Science author disambiguation.
  #' 
  #' This is work in progress. Please, file an issues or suggestion if you have any.
  #' @keywords internal
  "_PACKAGE"
#+END_SRC
** Set .Rprofile (developer enviroment)
*** CRAN Packages
:PROPERTIES:
:ID:       org:ihcia7119ri0
:END:
#+BEGIN_SRC R :tangle .Rprofile
    ## --------------------------------------------------------------------------------
    ## First load default packages getOption("defaultPackages")
    ## Otherwise it will add it at the end which can mask some funcitons
    .First.sys()


    ## some packages installations read .Rprofile loops the install
    current_wd <- getwd()
    setwd("~/")

    ## --------------------------------------------------------------------------------
    ## Load or Install Packages
    ## --------------------------------------------------------------------------------
    for(pkg in c('devtools'
               , 'roxygen2'
               ## , 'xml2'
               ## , 'tibble'
               , 'stringi'
               ## , 'stringr'
               , 'stringdist'
               , 'digest'
               , 'crayon'
               , 'magrittr'
               , 'lubridate'
               ## , 'plyr'
               ## , 'pipeR'
               ## , 'ggplot2'
               , 'pbapply'
               , 'testthat'
               , 'microbenchmark'
               , 'data.table'
               ## , 'dplyr'
  ))
        if(!require(pkg, character.only = TRUE)) {
            install.packages(pkg, repos = 'http://cloud.r-project.org')
            require(pkg, character.only = TRUE) }


    ## restore current working directore
    setwd(current_wd)

    ## --------------------------------------------------------------------------------
    library(disambr)

    ## update.packages(ask = FALSE, repos = 'http://cloud.r-project.org')

#+END_SRC
*** My Packages
:PROPERTIES:
:ID:       org:hzuia7119ri0
:END:
#+BEGIN_SRC R :results silent :session :tangle no
  ## --------------------------------------------------------------------------------
  ## Load My pakcages
  ## --------------------------------------------------------------------------------
  ## detach(package:romRDS, unload = TRUE)
  ## remove.packages("romRDS")
  if (!require("romRDS", character.only = TRUE)) {
    if(!require("devtools")) {
      install.packages("devtools"
                     , repos = 'http://cloud.r-project.org'
                     , dependencies = TRUE)
      require("devtools", character.only = TRUE)
    }
    install_github("stasvlasov/romRDS")
    require("romRDS", character.only = TRUE)
  }
  ## --------------------------------------------------------------------------------
#+END_SRC
** Set up package
#+name: document
#+BEGIN_SRC R :results none :tangle no

  .First.sys()

  ## --------------------------------------------------------------------------------
  ## Load or Install Packages
  ## --------------------------------------------------------------------------------
  for(pkg in c('devtools'
             , 'roxygen2'
             , 'xml2'
             , 'tibble'
             , 'stringi'
             , 'stringr'
             , 'stringdist'
             , 'digest'
             , 'magrittr'
             , 'lubridate'
             , 'plyr'
             , 'pipeR'
             , 'ggplot2'
             , 'microbenchmark'
             , 'data.table'
             , 'dplyr'))
    if(!require(pkg, character.only = TRUE)) {
      install.packages(pkg, repos = 'http://cloud.r-project.org')
      require(pkg, character.only = TRUE)
    }
  ## --------------------------------------------------------------------------------

  ## Describint package
  ## --------------------------------------------------------------------------------

  ## Include packages:
  package.packages <- c(
      "data.table"
    , "magrittr"
    , "stringi"
    , "stringr"
    , "tibble"
    , "xml2"
    , "dplyr")

  ## Print current packages verstions
  ## package.packages %>%
  ##     sapply(function(pkg)
  ##     paste0(pkg, " (>= ", packageVersion(pkg), ")"), USE.NAMES = FALSE) %>%
  ##     cat(sep = "\n")

  ## Adjust verstions manually
  package.packages.man.ver  <- c(
      "data.table (>= 1.12)"
    , "magrittr (>= 1.5)"
    , "stringi (>= 1.4)"
    , "parallel"
    ## , "stringr (>= 1.4)"
    ## , "dplyr (>= 0.8)"
    ## , "tibble (>= 2.0)"
    ## , "xml2 (>= 1.0)"
  )

  ## make description
  list(Package = "disambr"
     , Title  = "disambr - Named Entity Disambiguation in R"
     , Description = "disambr - Named Entity Disambiguation in R"
     , `Authors@R` = c(person(given = c("Stanislav" ,"A.") , family = "Vlasov"
                     , email = "stanislav.a.vlasov@gmail.com"
                     , role = c("aut", "cre"))
              , person(given = c("Olmo", "R."), family = "van den Akker"
                     , email = "ovdakker@gmail.com"
                     , role = "aut")
              , person(given = "Sacha", family = "Epskamp"
                     , email = "sacha.epskamp@gmail.com"
                     , role = "aut"))
     , Imports = paste(package.packages.man.ver
                     , collapse = ", ")
     , Depends = "R (>= 4.0), data.table (>= 1.12)"
     , Suggests = "testthat"
     , Version = "0.1"
     , Date = Sys.Date()
     , URL = "https://github.com/stasvlasov/disambr"
     , BugReports = "https://github.com/stasvlasov/disambr/issues"
     , References = "This research was supported (in part) by the Fetzer Franklin Fund of the John E. Fetzer Memorial Trust. The EVA disambiguation algorithm is described in van den Akker, O. R., Epskamp, Sacha, & Vlasov, S. A. (2020). The AEV Algorithm—Author name disambiguation for large Web of Science datasets."
           ) %>% use_description()

  use_lgpl_license(name = "Stanislav Vlasov")

  use_tidy_description()

  ## ----------------------------------------------------------------------------
  ## Update name spaces and documentation for functions
  roxygenise()


  ## This function is a wrapper for the ‘roxygen2::roxygenize()’ but also load the package
  ## document()

  ## ----------------------------------------------------------------------------
  ## Set up TestThat
  usethis::use_testthat()
#+END_SRC
** Deploy package
#+BEGIN_SRC R :tangle no
  ## Deploy
  ## --------------------------------------------------------------------------------
  install(".")

  install_github("stasvlasov/disambr")

  ## Test
  ## --------------------------------------------------------------------------------
  library("disambr")

  ## Remove
  ## --------------------------------------------------------------------------------
  detach(package:disambr, unload = TRUE)
  remove.packages("disambr")


  ## Just loadding
  ## --------------------------------------------------------------------------------

#+END_SRC

* Functions
#+BEGIN_SRC R :tangle no
  source("R/disambr_utils.r")
  source("R/disambr_mess.r")
  source("R/disambr_sets.r")
  source("R/disambr_wos_tsv.r")
  source("R/disambr_read.r")
  source("R/disambr_eva.r")

  ## just run tests
  test_dir("tests/testthat")
#+END_SRC
** disambr_options
| option                      | behaviour when not set |
|-----------------------------+------------------------|
| disambr_save_as             | NULL                   |
| disambr_save_set_prefix     | disambr-set.           |
| disambr_save_set_dir        | disambr-sets           |
| disambr_save_set_time_stamp | TRUE                   |
| disambr_verbose             | TRUE                   |
| disambr_mess_pretty         | FALSE                  |
| disambr_get_output_set      | FALSE                  |
| disambr_read_output_set     | FALSE                  |

** disambr_utils
*** dhms
:PROPERTIES:
:ID:       org:qdfaf650iti0
:END:
#+BEGIN_SRC R :tangle R/disambr_utils.r
  ##' Formats time difference as X days HH:MM:SS
  ##'
  ##' from https://stackoverflow.com/questions/27312292
  ##' @param t time diff
  ##' @return formatted time diff string
  ##' 
  ##' @export 
  dhms <- function(t) {
      t <-  abs(as.numeric(t, units = "secs"))
      paste(if((t %/% (60*60*24)) > 0) paste(t %/% (60*60*24), "days") else NULL
           ,paste(formatC(t %/% (60*60) %% 24, width = 2, format = "d", flag = "0")
                , formatC(t %/% 60 %% 60, width = 2, format = "d", flag = "0")
                , formatC(t %% 60, width = 2, format = "d", flag = "0")
                , sep = ":"))
  }
#+END_SRC

*** mess
**** create_mess
:PROPERTIES:
:ID:       org:dpadt1n0mti0
:END:

#+BEGIN_SRC R :tangle R/disambr_mess.r
  ##' Creates message string for reporting during procedures
      ##' @param mess Message to report. If prefixed by h `h_marks` it will be ouline of level `h`
      ##' @param h Forse specific ouline level of message
      ##' @param indent Forse indentation
      ##' @param prefix Add overal prefix
      ##' @param h_marks Marks that sets outline. Default is "-". Can be many characters, e.g. "-*#".
      ##' @param h_prefix Character vector of prefixes for each outline level
      ##' @param h_prefix_sep Separator between `h_prefix` and `mess`
      ##' @param pretty Whether to use "crayon" package for pretty printing
      ##' @param mess_color Color of message
      ##' @param h_prefix_color Color of ouline prefix
      ##' @param ... Here we can pass `verbose` argument from upper functions. Default is TRUE
      ##' @return Message string
      ##' 
      ##' @export 
      create_mess <- function(mess
                            , h = integer(0)
                            , indent = integer(0)
                            , prefix = ""
                            , h_marks = "-"
                            , h_prefix = character()
                            , h_prefix_sep = " "
                            , pretty = getOption("disambr_mess_pretty")
                            , mess_color = "green"
                            , h_prefix_color = "blue"
                            , ...) {
          ## set outline
          if(isTRUE(length(h) != 1)) {
              mess.regex <- paste0("^([", h_marks, "]*)\\s*(.*)")
              mess.parsed <-
                  stringi::stri_match_first_regex(mess, mess.regex)
              mess <- mess.parsed[[3]]
              h <- nchar(mess.parsed[[2]]) + 1
          }
          ## set h_prefix
          if(length(h_prefix) < h) {
              h_prefix_l <- length(h_prefix)
              ## if h_prefix is NULL
              if(h_prefix_l == 0) {
                  h_prefix <- ""
                  h_prefix_l <- 1
              }
              h_prefix <- c(h_prefix, rep(h_prefix[h_prefix_l], h - h_prefix_l))
          }
          ## set indentation
          if(isTRUE(length(indent) != 1)) {
              indent <-
                  nchar(paste(c("", h_prefix)[1:h], collapse = "")) +
                  (h-1)*nchar(h_prefix_sep)
              indent <- strrep(" ",  indent)
          } else{
              indent <-
                  switch(class(indent)
                       , numeric = if(indent == 0) ""
                                   else strrep(" ",  indent)
                       , character = indent)
          }
          ## create message
          h_prefix <- h_prefix[h]
          mess.plain <-
              paste0(prefix
                   , indent
                   , h_prefix
                   , h_prefix_sep
                   , mess)
          if(isTRUE(pretty) &&
             ## in case I want to move crayon to Sugests:
             requireNamespace("crayon", quietly = TRUE)) {
              h_prefix.style <-
                  crayon::make_style(h_prefix_color)
              mess.style <-
                  crayon::make_style(mess_color)
              mess.style <-
                  crayon::combine_styles(crayon::bold, mess.style)
              mess <-
                  Reduce(crayon::`%+%`
                       , list(prefix
                            , indent
                            , h_prefix.style(h_prefix)
                            , h_prefix_sep
                            , mess.style(mess)))
          } else {
              mess <- mess.plain
          }
          return(mess)
      }

#+END_SRC


**** disambr_mess
:PROPERTIES:
:ID:       org:nqfdt1n0mti0
:END:
#+BEGIN_SRC R :tangle R/disambr_mess.r
    ##' Report a message with message()
    ##' @param mess Message to report. If prefixed by h `h_marks` it will be ouline of level `h`
    ##' @param h_prefix Character vector of prefixes for each outline level
    ##' @inheritDotParams create_mess
    ##' @return Same as `message` returns
    ##' 
    ##' @md 
    ##' @export
    disambr_mess <- function(mess
                           , h_prefix = c("disambr:", "-")
                           , ...) {
        ## skip is not verbose (verbose by default)
        if(isFALSE(list(...)$verbose)) return()
        mess <- create_mess(mess, h_prefix = h_prefix, ...)
        ## post message
        message(mess)
    }
#+END_SRC

#+BEGIN_SRC R :tangle tests/testthat/test.disambr_mess.r
  test_that("disambr_mess", {
      expect_message(disambr_mess("Hello world!"))
      expect_null(disambr_mess("Hello world!", verbose = FALSE))
  })
#+END_SRC

**** disambr_mess_start
:PROPERTIES:
:ID:       org:9rmdt1n0mti0
:END:

#+BEGIN_SRC R :tangle R/disambr_mess.r
  ##' Post a starting message for disambr procedure. Records time started in `disambr_start_time` variable in its `parent.frame()`
  ##' @param start_mess_prefix Prefix for staring message
  ##' @inheritDotParams disambr_mess
  ##' @return time started
  ##' 
  ##' @export 
  disambr_mess_start <- function(start_mess_prefix = "Making set -"
                                , ...) {
      ## get name of running procedure
      running_procedure_name <- deparse(sys.calls()[[sys.nframe() - 1]])
      ## clean the call string
      running_procedure_name <-
          stringi::stri_replace_first_regex(running_procedure_name
                                          , c("^disambr_set_([^()]+).*")
                                          , "$1")
      mess <- paste(start_mess_prefix, running_procedure_name)
      disambr_mess(mess, ...)
      ## record the time started
      assign("disambr_start_time", Sys.time(), pos = parent.frame())
  }

#+END_SRC

#+BEGIN_SRC R :tangle tests/testthat/test.disambr_mess.r
  test_that("disambr_mess_start", {
      foo <- function() {
          disambr_mess_start()
          return(disambr_start_time)
      }
      expect_is(foo(), c("POSIXt", "POSIXct"))
      expect_message(foo(), )
  })
#+END_SRC

