disambr.src.org
*** TEMPLATE
:PROPERTIES:
:ID:       org:blbgnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r

#+END_SRC


*** disambr_read
:PROPERTIES:
:ID:       org:c7wgnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r
  ##' Reads the data for disambiguation
  ##' @param files_path Path to data. You can specify almost everything
  ##' @return 
  ##' 
  ##' @md 
  ##' @export 
  disambr_read <- function(files_path
                         , save_sets_as = NULL
                         , save_sets_dir = "disambr-data"
                         , use_time_stamp = FALSE) {
      disambr_mess_start()
      ## see if the data is available already
      if(is.character(save_sets_as) &&
         file.exists(file.path(save_sets_dir, save_sets_as))) {
          disambr_mess(paste("- reusing saved sets:", save_sets_as))
          return(readRDS(file.path(save_sets_dir, save_sets_as)))
      }
      files_path <- parse_files_path(files_path)
      files_data_list <- lapply(files_path, disambr_read_file)
      sets <- disambr_make_data(files_data_list)
      ## save just in case
      if(is.character(save_sets_as)) {
          disambr_save_set(sets
                         , save_set_as =  save_sets_as
                         , save_set_dir = save_sets_dir
                         , use_time_stamp = use_time_stamp)
      }
      disambr_mess_finish()
      return(sets)
  }
#+END_SRC

#+BEGIN_SRC R :tangle tests/testthat/test.disambr_read.r
  test_that("disambr_read", {
      my.file <- system.file("testdata", "wos-tsv-test-recent.txt", package = "disambr")
      skip_if_not(file.exists(my.file))
      expect_length(disambr_read(my.file), 4)
  })
#+END_SRC


test
#+BEGIN_SRC R

  ## my.dir <- '../data'
    ## my.dir.large <- '/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments'
    ## my.dir.huge <- '/mnt/md5/data/wos'


    ## my.file <- '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt' 
    ## my.file1 <- "/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments/LN Public NAICS records from 10001 to 10500.txt"

    ## my.files <- 
    ## c('../data/Journals in Mathematical Psychology/Applied Measurement in Education.txt'
    ## , '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt')

    my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
    dt <- my.file2 %>% disambr_read(save_sets_as = "data-test.rds")

    my.dir.small <- '../data/Journals in Mathematical Psychology'
    dt <- my.dir.small %>% disambr_read


    dt %>% sapply(class)

#+END_SRC

*** disambr_read_file
:PROPERTIES:
:ID:       org:zbtgnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r
  ##' Reads file based on file extention
  ##' @param f full file path name
  ##' @return data
  ##' 
  ##' @export 
  disambr_read_file <- function(f) {
      f_extention <- tools::file_ext(f)
      switch(f_extention
           , "tsv" = disambr_read_tsv(f)
             ## here we can add reading from .txt wos files
           , "txt" = disambr_read_tsv(f)
           , message("Disambr: can not read file extention: ", f_extention
                   , "\n  - skipping file: ", f))
  }
#+END_SRC

*** disambr_read_tsv
:PROPERTIES:
:ID:       org:vqqgnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r
  ##' Read tsv file
  ##' @param f path
  ##' @return data
  ##' 
  ##' @export 
  disambr_read_tsv <- function(f) {
        ## check tsv file type base on first line
        first_line <- readLines(f, n = 1
                              , warn = FALSE
                              , skipNul = TRUE)
        header <- parse_tsv_wos_header(first_line)
        if(!isFALSE(header)) {
            disambr_read_tsv_wos(f, header)
        } else {
            ## here we can add more tsv types
            message("Disambr: unrecognized header of tsv file: ", header
                  , "\n  - skipping file: ", f)
            NULL
        }
    }
#+END_SRC

*** parse_tsv_wos_header
:PROPERTIES:
:ID:       org:o5lgnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r
  parse_tsv_wos_header <- function(first_line) {
      header <- stri_split_fixed(first_line, "\t")[[1]]
      if( ## check if at least 10 fields two big letters
          sum(stri_detect_regex(header, "^[A-Z0-9]{2}$")) > 10 &&
          ## check if main fields are present
          all(c('AU', 'TI') %in% header)) {
          stri_extract_first_regex(header, "[A-Z0-9]{2}")
      } else {FALSE}
  }
#+END_SRC

*** disambr_read_tsv_wos
:PROPERTIES:
:ID:       org:o1ognb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r
  ##' Reads WoS tsv export file and makes disambr set out of it (just adding some attributes to the data.table)
  ##' @param f 
  ##' @param header 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @export 
  disambr_read_tsv_wos <- function(f, header) {
        s <- read_to_utf8(f)
        s <- recode_return_characters(s, f)
        f_data <- data.table::fread(text = s
                                  , skip = 1
                                  , strip.white = TRUE
                                  , header = FALSE
                                  , col.names = header
                                  , select = 1:length(header)
                                    ## , colClasses = rep("character", length(header))
                                  , quote=""
                                  , keepLeadingZeros = FALSE
                                  , encoding = "UTF-8"
                                  , sep = "\t")
        ## set attrib (file, funcall, meanning of the fields and data scheme)
        disambr_add_set_attr(f_data, NULL
                       , unit = "publication"
                       , reference = "self"
                       , type = "different"
                       , id = "index"
                       , strength = 1
                       , name = "wos_tsv"
                       , collection = "unit_table"
                       , recipe = list(func = "disambr_read_tsv_wos"
                                     , file_name = f
                                     , file_md5sum = tools::md5sum(f)
                                     , file_header = header))
        return(f_data)
    }
#+END_SRC

*** disambr_make_data
:PROPERTIES:
:ID:       org:33ignb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_read.r
  disambr_make_data <- function(files_data_list
                              , drop_ejected = FALSE) {
      ## TODO: add other data processing here
      ## TODO: add processing of wos data with differen headers
      ## check wos publication
      processabe_data <-
          disambr_in_sets(files_data_list, name = "wos_tsv")
      processabe_data <- files_data_list[processabe_data]
      if (length(processabe_data) != 0) {
          processabe_data_recipes <-
              lapply(processabe_data, attr, "disambr_set_recipe")
          processabe_data_headers <-
              lapply(processabe_data_recipes, `[[`, "file_header")
          ## check if all headers ate the same before rbindlist
          if (length(unique(processabe_data_headers)) == 1) {
              disambr_mess("Processing wos tsv export data..")
              disambr_mess("- rbinding wos publication tables..")
              wos_publication <-
                  disambr_make_wos_tsv_publications(files_data_list, processabe_data_recipes)
              disambr_mess("- making wos authors table..")
              wos_author <- disambr_make_wos_tsv_authors(wos_publication)
              if(drop_ejected) {
                  ## remove fields that we do not need
                  remove_headers <- c("AU", "AF", "C1", "RP", "EM", "RI", "OI")
                  ## filter those that exists
                  remove_headers <-
                      remove_headers[remove_headers %in% processabe_data_headers[[1]]]
                  ## remove headers without hard copy
                  ## to use a varialbe it should be in ()
                  wos_publication[, (remove_headers) := NULL]
              }
              disambr_mess("- making wos references table..")
              wos_reference <- disambr_make_wos_tsv_references(wos_publication)
              if(drop_ejected) {
                  remove_headers <- c("CR")
                  ## filter those that exists
                  remove_headers <-
                      remove_headers[remove_headers %in% processabe_data_headers[[1]]]
                  ## remove headers without hard copy
                  wos_publication[, (remove_headers) := NULL]
              }
              disambr_mess("- making author-year citations table..")
              citation_name_table <-
                  disambr_make_wos_tsv_author_year_citations(wos_publication, wos_reference)
              ## if all data is wos data return only that
              if(length(processabe_data) == length(files_data_list)) {
                  return(list(wos_publication
                            , wos_author
                            , wos_reference
                            , citation_name_table
                              ))
              } else {
                  return(list(
                      ## TODO implement
                      ## disambr_subsets(files_data_list
                                    ## , list(disambr_set_name = "wos_records_tsv_export")
                                    ## , negate_subsets = TRUE)
                    wos_publication
                    , wos_author
                    , wos_reference
                    , citation_name_table
                  ))
              }
          } else {
              disambr_mess("Files data has different headers. Skipping processing...")
              return(files_data_list)
          }
      } else {
          return(files_data_list)
      }
  }
#+END_SRC

*** disambr_make_wos_tsv_publications
:PROPERTIES:
:ID:       org:l7egnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  disambr_make_wos_tsv_publications <- function(tables_list, recipes) {
      publication_table <-
          data.table::rbindlist(tables_list, fill=TRUE)
      ## add ids, first_author_last_name, first_author_first_initials
      publication_table[
        , `:=`(id = 1:.N
             , first_author_last_name =
                   toupper(stringi::stri_extract_first_regex(AU, "^[^,]+"))
             , first_author_first_initial =
                   toupper(stringi::stri_extract_first_regex(AU, "(?<=, )[A-Za-z]"))
             , doi = stringi::stri_match_first_regex(DI
                                                 , "10.\\d{4,9}/[-._;()/:A-Za-z0-9]+"))]
      publication_table[
        , name_year := paste(first_author_last_name
                           , first_author_first_initial
                           , PY)]
      ## set publication attributes
      disambr_add_set_attr(publication_table, NULL
                     , unit = "publication"
                     , reference = "self"
                     , type = "different"
                     , strength = 1
                     , name = "wos_tsv_publications"
                     , collection = "unit_table"
                       ## add files recipies
                     , recipe = c(list('disambr_make_wos_tsv_publications')
                                , recipes))
      return(publication_table)
  }
#+END_SRC


#+BEGIN_SRC R :tangle tests/testthat/test.disambr_wos_tsv.r
  test_that("disambr_make_wos_tsv_publications", {
      my.file <- system.file("testdata", "wos-tsv-test-recent.txt", package = "disambr")
      skip_if_not(file.exists(my.file))
      dt <- list(disambr_read_file(my.file))
      expect_equal(disambr_make_wos_tsv_publications(dt, "recipe-lalala")$disambr_set_recipe, "recipe-lalala")
      expect_length(disambr_make_wos_tsv_publications(dt, "recipe-lalala"), 72)
  })

#+END_SRC


#+BEGIN_SRC R
  stringi::stri_extract_first_regex("Vlasov, asdf;", "(?<=, )[A-Za-z]")

  my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"

  a <- my.file2 %>% disambr_read_file %>% list %>% disambr_make_wos_tsv_publications("recipe-lalala")

  a %>% attributes

  a[, .(id, first_author_last_name, first_author_first_initial)]
#+END_SRC


*** disambr_wos_tsv_parse_au
:PROPERTIES:
:ID:       org:3q0cnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses AU column of WoS saved records export
  ##' @param record.au a record string from AU column
  ##' @return data.table
  ##' 
  ##' @md 
  disambr_wos_tsv_parse_au <- function(author_name) {
      author_last_name <-
          stringi::stri_extract_first_regex(author_name, "^[^,]+")
      author_initials <-
          stringi::stri_extract_first_regex(author_name, "(?<=, )[A-Z]+")
      data.table::data.table(author_name = author_name
                           , author_last_name = author_last_name
                           , author_initials = author_initials
                           , author_order = 1:length(author_name))
  }

  ## tests

  ## "Tilly, TB; Nelson, MT; Chakravarthy, KB; Shira, EA; Debrose, MC; Grabinski, CM; Salisbury, RL; Mattie, DR; Hussain, SM" %>% stri_split_fixed("; ") %>% 
  ## disambr_wos_tsv_parse_au
#+END_SRC

