R/disambr_wos_tsv.r
## -------->>  [[file:../disambr.src.org::*disambr_make_wos_tsv_publications][disambr_make_wos_tsv_publications:1]]
disambr_make_wos_tsv_publications <- function(tables_list, recipes) {
    publication_table <-
        data.table::rbindlist(tables_list, fill=TRUE)
    ## add ids, first_author_last_name, first_author_first_initials
    publication_table[
      , `:=`(id = 1:.N
           , first_author_last_name =
                 toupper(stringi::stri_extract_first_regex(AU, "^[^,]+"))
           , first_author_first_initial =
                 toupper(stringi::stri_extract_first_regex(AU, "(?<=, )[A-Za-z]"))
           , doi = stringi::stri_match_first_regex(DI
                                               , "10.\\d{4,9}/[-._;()/:A-Za-z0-9]+"))]
    publication_table[
      , name_year := paste(first_author_last_name
                         , first_author_first_initial
                         , PY)]
    ## set publication attributes
    disambr_add_set_attr(publication_table, NULL
                   , unit = "publication"
                   , reference = "self"
                   , type = "different"
                   , strength = 1
                   , name = "wos_tsv_publications"
                   , collection = "unit_table"
                     ## add files recipies
                   , recipe = c(list('disambr_make_wos_tsv_publications')
                              , recipes))
    return(publication_table)
}
## --------<<  disambr_make_wos_tsv_publications:1 ends here



## -------->>  [[file:../disambr.src.org::*disambr_wos_tsv_parse_au][disambr_wos_tsv_parse_au:1]]
##' Parses AU column of WoS saved records export
##' @param author_name a record string from AU column
##' @return data.table
##' 
##' @md 
disambr_wos_tsv_parse_au <- function(author_name) {
    author_last_name <-
        stringi::stri_extract_first_regex(author_name, "^[^,]+")
    author_initials <-
        stringi::stri_extract_first_regex(author_name, "(?<=, )[A-Z]+")
    data.table::data.table(author_name = author_name
                         , author_last_name = author_last_name
                         , author_initials = author_initials
                         , author_order = 1:length(author_name))
}

## tests

## "Tilly, TB; Nelson, MT; Chakravarthy, KB; Shira, EA; Debrose, MC; Grabinski, CM; Salisbury, RL; Mattie, DR; Hussain, SM" %>% stri_split_fixed("; ") %>% 
