disambr.src.org
*** disambr_wos_tsv_parse_af
:PROPERTIES:
:ID:       org:vy2cnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses AF (author full name) column of WoS saved records export
  ##' @param record.au a record string from AF column
  ##' @return Data.table
  disambr_wos_tsv_parse_af <- function(name) {
      last_name <- stringi::stri_extract_first_regex(name, "^[^,]+")
      first_names <- stringi::stri_extract_first_regex(name, "(?<=, ).*")
      first_names <-
          stringi::stri_split_fixed(first_names, " ", omit_empty = TRUE)
      ## first.full.name is first name without dot
      first_full_name <-
          lapply(first_names, function(n) {
              n[!stringi::stri_detect_regex(n, "\\.$")][1]
          })
      ## return
      data.table::data.table(
                      author_full_name = name
                    ## , author_last_name = last_name 
                    , author_first_names = first_names
                    , author_first_full_name =  first_full_name)
  }


  ## test
  ## "Tilly, Trevor B.; Nelson, M. Tyler; Chakravarthy, Karthik B.; Shira, Emily A.; Debrose, Madeline C.; Grabinski, Christin M.; Salisbury, Richard L.; Mattie, David R.; Hussain, Saber M." %>%
  ## disambr_wos_tsv_parse_af
#+END_SRC

*** disambr_wos_tsv_parse_rp
:PROPERTIES:
:ID:       org:1t5cnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses RP (reprint author) column of WoS saved records export
  ##' @param record_rp a record string from RP column
  ##' @return Data.table with two columns -  author_name and affiliations
  disambr_wos_tsv_parse_rp <- function(record_rp) {
      record_rp_init <- ""
      authors_table <-
          data.table::data.table(author_name = character(0)
                               , affiliations = character(0))
      while(record_rp != record_rp_init) {
          record_rp_init <- record_rp
          record_rp_split <- 
              stringi::stri_match_first_regex(
                           record_rp
                         , "\\s*([^()]+)\\s+\\((corresponding author|reprint author)\\)([^;]+)")
          authors <-
              stringi::stri_split_fixed(record_rp_split[1,2], "; ")[[1]]
          affiliation <-
              stringi::stri_replace_first_regex(
                           record_rp_split[1,4], "^[\\s,.;]+", "")
          for (author in authors) {
              ## check if author is already in the list
              authors_table_match <-
                  authors_table$author_name %in% author
              if(any(authors_table_match)) {
                  ## add affiliation to affiliations of author
                  ## the data.table way..
                  authors_table[authors_table_match
                              , affiliations :=
                                    list(c(unlist(affiliations), affiliation))]
              } else {
                  ## add new author with affiliation otherwise
                  authors_table <-
                      data.table::rbindlist(
                                      list(authors_table
                                         , list(author_name = author
                                              , affiliations =
                                                    list(affiliation))))
              }
          }
          record_rp <-
              stringi::stri_replace_first_regex(
                           record_rp
                         , "[^()]+\\((corresponding author|reprint author)\\)[^;]+[;]", "")
      }
      ## results are not printed but the data.table is returned
      return(authors_table)
  }

  ## "Guesmi, S (corresponding author), Natl Agron Inst Tunisia INAT, 43 Ave Charles Nicolle, Tunis 1082, Tunisia.; Guesmi, S; Sghaier, H (corresponding author), Sidi Thabet Technopk, Natl Ctr Nucl Sci & Technol, Lab Energy & Matter Dev Nucl Sci LR16CNSTN02, Sidi Thabet 2020, Tunisia.; Sghaier, H (corresponding author), Sidi Thabet Technopk, Lab Biotechnol & Nucl Technol LR16CNSTN01, Sidi Thabet 2020, Tunisia.; Sghaier, H (corresponding author), Sidi Thabet Technopk, Lab Biotechnol & Biogeo Resources Valorizat LR11E, Sidi Thabet 2020, Tunisia." %>%
  ## disambr_wos_tsv_parse_rp %>% print

  ## "" %>%
  ## disambr_wos_tsv_parse_rp %>% nrow
#+END_SRC

*** disambr_wos_tsv_parse_em
:PROPERTIES:
:ID:       org:wl8cnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses EM (email) column of WoS saved records export
  ##' @param record_em  a record string from EM column
  ##' @param record_au_table a data_tabe after parsing AU column with disambr_wos_tsv_parse_au
  ##' @param record_rp_table a data_tabe after parsing RP column with disambr_wos_tsv_parse_rp
  ##' @return Data.table with columns - author_name, affiliations and email
  disambr_wos_tsv_parse_em <- function(emails
                                           , record_au_table
                                           , record_rp_table) {
      if (isTRUE(length(emails) == 1 && emails == "")) {
          ## in case there are no emails
          record_au_table[, author_email := NA]
      } else if (isTRUE(length(emails) == nrow(record_rp_table))) {
          ## assume that emails corresponds RP authors
          record_au_table[match(record_rp_table$author_name, author_name)
                        , author_email := emails]
      } else if (isTRUE(length(emails) == nrow(record_au_table))) {
          ## assume that emails corresponds AU authors
          record_au_table[, author_email := emails]
      } else if (isTRUE(nrow(record_rp_table) != 0)) {
          ## in other cases just use first email for first RP author
          record_au_table[match(record_rp_table$author_name, author_name)[1]
                        , author_email := emails[1]]
      } else {
          ## if no RP assignt to first in AU
          record_au_table[1, author_email := emails[1]]
      }
      ## we do not need to return things as it updates record_au_table
      return(record_au_table)
  }


  ## tests
  ## disambr_wos_tsv_parse_em(
  ## record_em = "a"
  ## , record_au_table = data.table(author_name = c(1,2,3,4))
  ## , record_rp_table = data.table(author_name = c(3))
  ## ) %>% print
#+END_SRC
