disambr.src.org
*** disambr_wos_tsv_parse_c1
:PROPERTIES:
:ID:       org:qrdfnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses C1 (author adress/affiliation) column of WoS saved records export
  ##' @param record_c1 a record string from RP column
  ##' @return Data.table with two columns -  author_name and affiliations
  disambr_wos_tsv_parse_c1 <- function(record_c1
                                           , table_af = NULL) {
      record_c1_init <- ""
      authors_table <-
          data.table::data.table(author_full_name = character()
                               , affiliations = list())
      while(record_c1 != record_c1_init) {
          record_c1_init <- record_c1
          record_c1_piece <- 
              stringi::stri_match_first_regex(
                           record_c1, "\\s*\\[([^\\[\\]]+)\\]\\s+([^;]+)\\s*")
          authors <-
              stringi::stri_split_fixed(record_c1_piece[1,2], "; ")[[1]]
          affiliation <- record_c1_piece[1,3]
          for (author in authors) {
              ## check if author is already in the list
              authors_table_match <-
                  authors_table$author_full_name %in% author
              if(any(authors_table_match)) {
                  ## add affiliation to affiliations of author
                  ## the data.table way..
                  authors_table[authors_table_match
                              , affiliations :=
                                    list(c(unlist(affiliations), affiliation))]
              } else {
                  ## add new author with affiliation otherwise
                  authors_table <-
                      data.table::rbindlist(list(authors_table
                                               , list(author_full_name = author
                                                    , affiliations = list(affiliation))))
              }
          }
          record_c1 <-
              stringi::stri_replace_first_regex(
                           record_c1, "\\s*\\[[^\\[\\]]+\\][^;]+[;]", "")
      }
      ## merge with table_af if provided
      if(length(table_af) != 0) {
          return(authors_table[table_af
                             , on = "author_full_name"
                             , .(affiliations)])
      } else {
          return(authors_table)
      }
  }



  ## "[Wang, Menglei; Li, Shunyi; Zhu, Rencheng; Zhang, Ruiqin] Zhengzhou Univ, Sch Ecol & Environm, Zhengzhou 450001, Peoples R China; [Wang, Menglei] Zhengzhou Univ, Sch Chem Engn, Zhengzhou 450001, Peoples R China; [Zu, Lei; Wang, Yunjing; Bao, Xiaofeng] Chinese Res Inst Environm Sci, State Environm Protect Key Lab Vehicle Emiss Cont, Beijing 100012, Peoples R China" %>%
  ## disambr_wos_tsv_parse_c1


  ## "[Wang, Menglei; Li, Shunyi; Zhu, Rencheng; Zhang, Ruiqin] Zhengzhou Univ, Sch Ecol & Environm, Zhengzhou 450001, Peoples R China; [Wang, Menglei] Zhengzhou Univ, Sch Chem Engn, Zhengzhou 450001, Peoples R China; [Zu, Lei; Wang, Yunjing; Bao, Xiaofeng] Chinese Res Inst Environm Sci, State Environm Protect Key Lab Vehicle Emiss Cont, Beijing 100012, Peoples R China" %>%
  ## disambr_wos_tsv_parse_c1(disambr_wos_tsv_parse_af("Wang, Menglei; Zu, Lei; Wang, Yunjing; Bao, Xiaofeng"))
#+END_SRC
*** disambr_wos_tsv_parse_oi
:PROPERTIES:
:ID:       org:jygfnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses OI column of WoS saved records export
  ##' @param record_oi a record string from OI column
  ##' @return data.table
  ##' 
  ##' @md 
  disambr_wos_tsv_parse_oi <- function(authors
                                            , table_af = NULL) {
      author_full_name <-
          stringi::stri_extract_first_regex(authors, "^[^/]+")
      author_orcid <-
          stringi::stri_extract_first_regex(authors, "(?<=/).+")
      authors_table <- 
          data.table::data.table(author_full_name = author_full_name
                               , author_orcid = author_orcid)
      ## take care of propable case of multiple ID for one person
      author_full_name_unique <- unique(authors_table$author_full_name)
      author_orcid_list <-
          lapply(author_full_name_unique
               , function(x) {
                   authors_table$author_orcid[authors_table$author_full_name %in% x]
               })
      authors_table <-
          data.table::data.table(author_full_name = author_full_name_unique
                               , author_orcid = author_orcid_list)
      if(length(table_af) != 0) {
          return(authors_table[table_af
                             , on = "author_full_name"
                             , .(author_orcid)])
      } else {
          return(authors_table)
      }
  }



  ## "Estrela, Pedro/0000-0001-6956-1146; Maxted, Grace/0000-0002-6816-9107; Rainbow, Joshua/0000-0003-3911-928X; Richtera, Lukas/0000-0002-8288-3999; Moschou, Despina/0000-0001-9175-5852" %>%
      ## disambr_make_wos_tsv_authors__parse_oi



  ## "Estrela, Pedro/0000-0001-6956-1146; Maxted, Grace/0000-0002-6816-9107; Rainbow, Joshua/0000-0003-3911-928X; Rainbow, Joshua/0000-0003-3911-928X; Richtera, Lukas/0000-0002-8288-3999; Moschou, Despina/0000-0001-9175-5852" %>%
      ## disambr_make_wos_tsv_authors__parse_oi(
          ## table_af = data.table(author_full_name =
                                    ## c("Rainbow, Joshua", "Moschou, Despina")))                                                                                       

  ## "" %>% disambr_make_wos_tsv_authors__parse_oi(
             ## table_af = data.table(author_full_name = c("Rainbow, Joshua")))

  ## NA %>% disambr_make_wos_tsv_authors__parse_oi
#+END_SRC

*** disambr_wos_tsv_parse_ri
:PROPERTIES:
:ID:       org:5ljfnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
##' Parses RI column of WoS saved records export
  ##' @param record_ri a record string from RI column
  ##' @return data.table
  ##' 
  ##' @md 
  disambr_wos_tsv_parse_ri <- function(authors
                                            , table_af = NULL) {
      author_full_name <-
          stringi::stri_extract_first_regex(authors, "^[^/]+")
      author_researcher_id <-
          stringi::stri_extract_first_regex(authors, "(?<=/).+")
      authors_table <- 
          data.table::data.table(author_full_name = author_full_name
                               , author_researcher_id = author_researcher_id)
      ## take care of propable case of multiple ID for one person
      author_full_name_unique <- unique(authors_table$author_full_name)
      author_researcher_id_list <-
          lapply(author_full_name_unique
               , function(x) {
                   authors_table$author_researcher_id[
                                     authors_table$author_full_name %in% x]
               })
      authors_table <-
          data.table::data.table(author_full_name = author_full_name_unique
                               , author_researcher_id = author_researcher_id_list)
      if(length(table_af) != 0) {
          return(authors_table[table_af
                             , on = "author_full_name"
                             , .(author_researcher_id)])
      } else {
          return(authors_table)
      }
  }


#+END_SRC
