disambr.src.org
*** disambr_make_wos_tsv_authors
:PROPERTIES:
:ID:       org:7cofnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses all WoS field related to authors and makes author table
  ##'
  ##' Relevant fields that are parsed (as in Web of Science Field Tags 2018-06-27):
  ##' - AU
  ##' - AF (full names)
  ##' - C1 adresses
  ##' - RP reprint address (one you contact for reprint copy)
  ##' - EM emails
  ##' - RI researcher ID
  ##' - OI ORCID Identifier (Open Researcher and Contributor ID)
  ##'
  ##' Fields that are not parsed
  ##' - BA book - not parsed
  ##' - BF book - not parsed
  ##' - CA gp group author (usually organization or group name) - not parsed
  ##' - BE editors - not parsed
  ##' @param wos_data_table WoS tsv export data.table
  ##' @param list_of_author_fields list of data to parse to construct (if not all selected as by default it will save time)
  ##' @param ... set verbose if needed here
  ##' @return author table
  ##' 
  ##' @md 
  ##' @export 
  disambr_make_wos_tsv_authors <- function(wos_data_table
                                  , list_of_author_fields =
                                        c("author_order"
                                        , "author_short_name"
                                        , "author_initials"
                                        , "author_last_name"
                                        , "author_full_name"
                                        , "author_first_names"
                                        , "author_first_full_name"
                                        , "author_email"
                                        , "author_researcher_id"
                                        , "author_orcid"
                                        , "author_affiliations")
                                  , ...) {
      disambr_mess_start(start_mess_prefix = "-- making set")
      authors_tables <- list()
      ## AU
      if(any(c("author_order"
             , "author_short_name"
             , "author_last_name"
             , "author_initials"
             , "author_email") %in% list_of_author_fields) &&
         "AU" %in% names(wos_data_table)) {
          disambr_mess("-- parsing AU field", ...)
          authors_tables$au <-
              lapply(
                  stringi::stri_split_fixed(wos_data_table$AU, "; ")
                , disambr_wos_tsv_parse_au)
      }
      ## AF
      if(any(c("author_full_name"
             , "author_first_names"
             , "author_first_full_name"
             , "author_researcher_id"
             , "author_orcid"
             , "author_affiliations") %in% list_of_author_fields) &&
         "AF" %in% names(wos_data_table)) {
          disambr_mess("-- parsing AF field", ...)
          authors_tables$af <-
              lapply(
                  stringi::stri_split_fixed(wos_data_table$AF, "; ")
                , disambr_wos_tsv_parse_af)
      }
      ## RP
      if(any(c("author_email") %in% list_of_author_fields) &&
         "RP" %in% names(wos_data_table)) {
          disambr_mess("-- parsing RP field", ...)
          ## save RP separately as it is different order from AU
          rp <-
              lapply(wos_data_table$RP
                   , disambr_wos_tsv_parse_rp)
      }

      ## EM
      if(any(c("author_email") %in% list_of_author_fields) &&
         all(c("AU", "EM", "RP") %in% names(wos_data_table))) {
          disambr_mess("-- parsing EM field", ...)
          ## disambr_wos_tsv_parse_em updates authors_tables$au
          ## so no need to save it
          pbmapply(disambr_wos_tsv_parse_em
               , stringi::stri_split_fixed(wos_data_table$EM, "; ")
               , authors_tables$au
               , rp
               , SIMPLIFY = FALSE
               , USE.NAMES = FALSE)
      }
      ## C1
      if(any(c("author_affiliations") %in% list_of_author_fields) &&
         all(c("C1", "AF") %in% names(wos_data_table))) {
          disambr_mess("-- parsing C1 field", ...)
          authors_tables$c1 <-
              pbmapply(disambr_wos_tsv_parse_c1
                   , wos_data_table$C1
                   , authors_tables$af
                   , SIMPLIFY = FALSE)
      }
      ## RI
      if(any(c("author_researcher_id") %in% list_of_author_fields) &&
         all(c("RI", "AF") %in% names(wos_data_table))) {
          disambr_mess("-- parsing RI field", ...)
          authors_tables$ri <-
              pbmapply(disambr_wos_tsv_parse_ri
                   , stringi::stri_split_fixed(wos_data_table$RI, "; ")
                   , authors_tables$af
                   , SIMPLIFY = FALSE
                   , USE.NAMES = FALSE)
      }
      ## OI
      if(any(c("author_orcid") %in% list_of_author_fields) &&
         all(c("OI", "AF") %in% names(wos_data_table))) {
          disambr_mess("-- parsing OI field", ...)
          authors_tables$oi <-
              pbmapply(disambr_wos_tsv_parse_oi
                   , stringi::stri_split_fixed(wos_data_table$OI, "; ")
                   , authors_tables$af
                   , SIMPLIFY = FALSE
                   , USE.NAMES = FALSE)
      }
      ## remove duplicated columns
      disambr_mess("-- stacking author fields", ...)
      authors_tables <- 
          lapply(authors_tables, data.table::rbindlist, idcol = "paper_id")
      authors_table <- do.call(cbind, authors_tables)
      authors_table_names <- 
          stringi::stri_replace_first_regex(names(authors_table), "^[^\\.]+\\.", "")
      authors_table_select <- which(!duplicated(authors_table_names))
      authors_table_new_names <- authors_table_names[authors_table_select]
      authors_table <- authors_table[, authors_table_select, with = FALSE]
      ## set names
      data.table::setnames(authors_table, authors_table_new_names)
      ## set author attributes
      disambr_add_set_attr(authors_table
                         , wos_data_table
                         , unit = "person"
                         , reference = "wos_tsv_publications"
                         , type = "similar"
                         , strength = 0.1
                         , name = "wos_tsv_authors")
      disambr_save_set(authors_table)
      disambr_mess_finish(mess = "-- finished -")
      return(authors_table)
  }
#+END_SRC

#+BEGIN_SRC R :tangle tests/testthat/test.disambr_wos_tsv.r
test_that("disambr_make_wos_tsv_authors", {
    my.file <- system.file("testdata", "wos-tsv-test-recent.txt", package = "disambr")
    skip_if_not(file.exists(my.file))
    dt <- disambr_read_file(my.file)
    expect_length(attributes(disambr_make_wos_tsv_authors(dt))$disambr_set_recipe, 2)
})
#+END_SRC


#+BEGIN_SRC R

  ## test
    my.file <- system.file("testdata", "wos-tsv-test-recent.txt", package = "disambr")

    my.file <- "inst/testdata/wos-tsv-test-recent.txt"
    dt <- disambr_read_file(my.file)

    dt %>% attributes

    disambr_make_wos_tsv_authors(dt) %>% attributes

    ## testing dt merge
    a <- data.table(name = c("a", "b", "c"), order = c(1,2,3))
    b <- data.table(named = c("c", "b", "c"), affil = c("b-adfsa","c-sadfsd"))
    cbind(a, b, check.names = FALSE)

#+END_SRC


