disambr.src.org
*** disambr_wos_tsv_parse_cr
:PROPERTIES:
:ID:       org:35sfnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Parses WoS CR (Cited References) record into separate talbe
  ##' @param references CR (Cited References) record, i.e., just one row
  ##' @return references table
  ##' 
  ##' @export 
  disambr_wos_tsv_parse_cr <- function(references) {
      references_list <- stringi::stri_split_fixed(references, ", ")
      references_list <-
          lapply(references_list, function(ref) {
              first_author_last_name_first_initial <-
                  stringi::stri_match_first_regex(ref[1], "([a-z ]*[A-Z][^ ]+)\\s+([A-Z])")
              ref_tail <- ref[-c(1:3)]
              vol <- stringi::stri_extract_first_regex(ref_tail, "(?<=^V)\\d+")
              vol <- vol[!sapply(vol, is.na)][1]
              page <- stringi::stri_extract_first_regex(ref_tail, "(?<=^P)\\d+")
              page <- page[!sapply(page, is.na)][1]
              doi <-
                  stringi::stri_match_first_regex(ref_tail
                                                , "10.\\d{4,9}/[-._;()/:A-Za-z0-9]+")
              doi <- doi[!sapply(doi, is.na)][1]
              name_year <- paste(first_author_last_name_first_initial[2]
                               , first_author_last_name_first_initial[3]
                               , ref[2])
              ## combine
              list(first_author_name = ref[1]
                 , first_author_last_name = first_author_last_name_first_initial[2]
                 , first_author_first_initial = first_author_last_name_first_initial[3]
                 , year = ref[2]
                 , outlet = ref[3]
                 , vol = vol
                 , page = page
                 , doi = doi
                 , name_year = name_year)
          })
      suppressWarnings(data.table::rbindlist(references_list))
  }

#+END_SRC


#+BEGIN_SRC R :tangle tests/testthat/test.disambr_wos_tsv.r
  test_that("disambr_wos_tsv_parse_cr", {
    d <- "Allen C, 2017, ENVIRON SCI-NANO, V4, P741, DOI 10.1039/c7en90014g; Baek YW, 2011, SCI TOTAL ENVIRON, V409, P1603, DOI 10.1016/j.scitotenv.2011.01.014; Baker GL, 2008, TOXICOL SCI, V101, P122, DOI 10.1093/toxsci/kfm243; Bergstrom U, 2015, J TOXICOL ENV HEAL A, V78, P645, DOI 10.1080/15287394.2015.1017682; Bhushan B, 2011, PROG MATER SCI, V56, P1, DOI 10.1016/j.pmatsci.2010.04.003; Biswas P, 2005, J AIR WASTE MANAGE, V55, P708, DOI 10.1080/10473289.2005.10464656; Bitterle E, 2006, CHEMOSPHERE, V65, P1784, DOI 10.1016/j.chemosphere.2006.04.035; Bondarenko O, 2013, ARCH TOXICOL, V87, P1181, DOI 10.1007/s00204-013-1079-4; Bonner J. C., 2003, ENV HLTH PERSPECT, V111, P1289; Brossell D, 2013, J AEROSOL SCI, V63, P75, DOI 10.1016/j.jaerosci.2013.04.012; Clift MJD, 2011, ARCH TOXICOL, V85, P723, DOI 10.1007/s00204-010-0560-6; Cohen J, 2013, NANOTOXICOLOGY, V7, P417, DOI 10.3109/17435390.2012.666576; Cohen JM, 2014, PART FIBRE TOXICOL, V11, DOI 10.1186/1743-8977-11-20; Comouth A, 2013, J AEROSOL SCI, V63, P103, DOI 10.1016/j.jaerosci.2013.04.009"
    expect_equal(nrow(disambr_wos_tsv_parse_cr(stri_split_fixed(d, "; ")[[1]])), 14)
    })
#+END_SRC

#+BEGIN_SRC R
  a[[3]]$first_author_name

  testing authors harmonization
  c("de Sena RC"
  , "Viola Roberto"
  , "US Environmental Protection Agency"
  , "WENG Shi-fu"
  , "[Anonymous]"
  , "LANGENHEIM JH"
  , "van Doosselaere P"
  , "USDA"
  , "Kosmowska-Ceranowicz Barbara") %>%
  ## stri_match_first_regex("([a-z ]*[A-Z][^ ]+)\\s+([A-Z])")
  stringi::stri_extract_first_regex("[a-z ]*[A-Z][^ ]+")

#+END_SRC

*** disambr_make_wos_tsv_references
:PROPERTIES:
:ID:       org:jxufnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Make references table from WoS tsv data
  ##' @param wos_data_table WoS data
  ##' @param ... set verbose here if neededj
  ##' @return references table
  ##' 
  ##' @export 
  disambr_make_wos_tsv_references <- function(wos_data_table
                                            , ...) {
      ## disambr_mess_start()
      if("CR" %in% names(wos_data_table)) {
          disambr_mess("-- parsing references", ...)
          references_list <-
              pblapply(stringi::stri_split_fixed(wos_data_table$CR, "; ")
                     , disambr_wos_tsv_parse_cr)
          disambr_mess("-- stacking references", ...)
          references_table <-
              data.table::rbindlist(references_list, idcol = "paper_id")
          disambr_mess("-- matching DOI citations", ...)
          ## assume unique doi
          doi_match <- match(references_table$doi
                           , wos_data_table$doi
                           , incomparables = NA
                           , nomatch = NA)
          if(any(!is.na(doi_match))){
              references_table[, "doi_cited_id" := wos_data_table$id[doi_match]]
          } else {
              references_table[, "doi_cited_id" := NA]
          }
          ## set references attributes
          disambr_add_set_attr(references_table, wos_data_table
            , reference = "wos_tsv_publications"
            , type = "similar"
            , strength = 0.1
            , name = "wos_tsv_references"
            , collection = "unit_table")
          ## disambr_mess_finish()
          return(references_table)
      } else {
          disambr_stop("THERE IS NOT 'CR' FIELD WITH REFERENCES!")
      }
  }


#+END_SRC

#+BEGIN_SRC R :tangle tests/testthat/test.disambr_wos_tsv.r
test_that("disambr_make_wos_tsv_references", {
  my.file <- system.file("testdata", "wos-tsv-test-recent.txt", package = "disambr")
    skip_if_not(file.exists(my.file))
    dt <- disambr_read_file(my.file)
    expect_length(nrow(disambr_make_wos_tsv_references(dt)), 3760)
})

#+END_SRC

#+BEGIN_SRC R
my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
dt <- disambr_read_file(my.file2)

disambr_make_wos_tsv_references(dt) %>% print

dt[[3]]$doi_cited_id %>% is.na %>% not %>% sum

my.dir.small <- '../data/Journals in Mathematical Psychology'
dt <- my.dir.small %>% disambr_read

dt[[3]]
dt[[3]]$doi_cited_id %>% is.na %>% not %>% sum
dt[[3]]$name_cited_id %>% is.na %>% not %>% sum

#+END_SRC

*** disambr_make_wos_tsv_author_year_citations                               
:PROPERTIES:
:ID:       org:to0gnb60jti0
:END:
#+BEGIN_SRC R :tangle R/disambr_wos_tsv.r
  ##' Makes citations table by matching first author - year keys. This, of course, can produce false positives matched
  ##' @param pub_table WoS publications data table
  ##' @param ref_table WoS references data table
  ##' @return citation table
  ##' 
  ##' @export 
  disambr_make_wos_tsv_author_year_citations <- function(pub_table, ref_table) {
      ## filter before maching
      pub_table[, "year" := as.character(PY)]
      pub_table <- pub_table[!is.na(first_author_last_name) &
                             !is.na(first_author_first_initial) &
                             !is.na(year)
                           , .(first_author_last_name
                             , first_author_first_initial
                             , year
                             , cited_id = id)]
      ref_table <- ref_table[!is.na(first_author_last_name) &
                             !is.na(first_author_first_initial) &
                             !is.na(year)
                           , .(first_author_last_name
                             , first_author_first_initial
                             , year
                             , citing_id = paper_id)]
      cit_table <- 
          merge(pub_table, ref_table
              , by = c("first_author_last_name"
                     , "first_author_first_initial"
                     , "year"), allow.cartesian = TRUE)
      cit_table <- cit_table[, .(citing_id, cited_id
                                 ## , first_author_last_name
                                 ## , first_author_first_initial
                                 ## , year
                                 )]
      disambr_add_set_attr(cit_table, ref_table
                         , name = "wos_tsv_author_year_citations"
                         , collection = "dyad_table"
                         , reference = "wos_tsv_publications")
      return(cit_table)
  }

#+END_SRC

#+BEGIN_SRC R
  is.na(c(1,2,NA))

  ## testing data.table
  p <- data.table(c(1,2,3,4)
                , b = TRUE
                , y = c(7,4,6,3)
                , n = c("o", "z", "o", "e")
                , DI = c(11,22,33,44))
  p[, id := 1:.N]
  r <- data.table(paper_id = c(1,1,2,2,4,4)
                , b = FALSE
                , y = c(2,6,4,8,3,1)
                , n = c("a", "c", "z", "o", "e", "o")
                , doi = c(88,22,99,55,11,55))

  p[r
  , on = .(y, n)
  , .(DI, doi, citation_id = id, paper_id, b, y, n)]


  ## test function
  my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  dt <- disambr_read(my.file2)

  my.dir.small <- '../data/Journals in Mathematical Psychology'
  dt <- disambr_read(my.dir.small)

  dt[[1]]$first_author_last_name %>% sapply(is.na) %>% which

  dt[[1]] %>% nrow
  dt[[3]] %>% nrow

  disambr_make_wos_tsv_author_year_citations(dt[[1]], dt[[3]])

  disambr_make_wos_tsv_author_year_citations(dt[[1]], dt[[3]])$first_author_last_name %>% sapply(is.na) %>% sum

  ## dt[[1]]$AU[3771]
  ## dt[[1]]$CR[3514]

#+END_SRC


