R/disambr_wos_tsv.r
## --------<<  disambr_make_wos_tsv_authors:1 ends here



## -------->>  [[file:../disambr.src.org::*disambr_wos_tsv_parse_cr][disambr_wos_tsv_parse_cr:1]]
##' Parses WoS CR (Cited References) record into separate talbe
##' @param references CR (Cited References) record, i.e., just one row
##' @return references table
##' 
##' @export 
disambr_wos_tsv_parse_cr <- function(references) {
    references_list <- stringi::stri_split_fixed(references, ", ")
    references_list <-
        lapply(references_list, function(ref) {
            first_author_last_name_first_initial <-
                stringi::stri_match_first_regex(ref[1], "([a-z ]*[A-Z][^ ]+)\\s+([A-Z])")
            ref_tail <- ref[-c(1:3)]
            vol <- stringi::stri_extract_first_regex(ref_tail, "(?<=^V)\\d+")
            vol <- vol[!sapply(vol, is.na)][1]
            page <- stringi::stri_extract_first_regex(ref_tail, "(?<=^P)\\d+")
            page <- page[!sapply(page, is.na)][1]
            doi <-
                stringi::stri_match_first_regex(ref_tail
                                              , "10.\\d{4,9}/[-._;()/:A-Za-z0-9]+")
            doi <- doi[!sapply(doi, is.na)][1]
            name_year <- paste(first_author_last_name_first_initial[2]
                             , first_author_last_name_first_initial[3]
                             , ref[2])
            ## combine
            list(first_author_name = ref[1]
               , first_author_last_name = first_author_last_name_first_initial[2]
               , first_author_first_initial = first_author_last_name_first_initial[3]
               , year = ref[2]
               , outlet = ref[3]
               , vol = vol
               , page = page
               , doi = doi
               , name_year = name_year)
        })
    suppressWarnings(data.table::rbindlist(references_list))
}
## --------<<  disambr_wos_tsv_parse_cr:1 ends here



## -------->>  [[file:../disambr.src.org::*disambr_make_wos_tsv_references][disambr_make_wos_tsv_references:1]]
##' Make references table from WoS tsv data
##' @param wos_data_table WoS data
##' @param ... set verbose here if neededj
##' @return references table
##' 
##' @export 
disambr_make_wos_tsv_references <- function(wos_data_table
                                          , ...) {
    ## disambr_mess_start()
    if("CR" %in% names(wos_data_table)) {
        disambr_message("-- parsing references", ...)
        references_list <-
            pbapply::pblapply(stringi::stri_split_fixed(wos_data_table$CR, "; ")
                   , disambr_wos_tsv_parse_cr)
        disambr_message("-- stacking references", ...)
        references_table <-
            data.table::rbindlist(references_list, idcol = "paper_id")
        disambr_message("-- matching DOI citations", ...)
        ## assume unique doi
        doi_match <- match(references_table$doi
                         , wos_data_table$doi
                         , incomparables = NA
                         , nomatch = NA)
        if(any(!is.na(doi_match))){
            references_table[, "doi_cited_id" := wos_data_table$id[doi_match]]
        } else {
            references_table[, "doi_cited_id" := NA]
        }
        ## set references attributes
        disambr_add_set_attr(references_table, wos_data_table
          , reference = "wos_tsv_publications"
          , type = "similar"
          , strength = 0.1
          , name = "wos_tsv_references"
          , collection = "unit_table")
        ## disambr_mess_finish()
        return(references_table)
    } else {
        disambr_stop("THERE IS NOT 'CR' FIELD WITH REFERENCES!")
    }
}
## --------<<  disambr_make_wos_tsv_references:1 ends here



## -------->>  [[file:../disambr.src.org::*disambr_make_wos_tsv_author_year_citations][disambr_make_wos_tsv_author_year_citations:1]]
##' Makes citations table by matching first author - year keys. This, of course, can produce false positives matched
##' @param pub_table WoS publications data table
##' @param ref_table WoS references data table
##' @return citation table
##' 
##' @export 
disambr_make_wos_tsv_author_year_citations <- function(pub_table, ref_table) {
    ## filter before maching
    pub_table[, "year" := as.character(PY)]
    pub_table <- pub_table[!is.na(first_author_last_name) &
                           !is.na(first_author_first_initial) &
                           !is.na(year)
                         , .(first_author_last_name
                           , first_author_first_initial
                           , year
                           , cited_id = id)]
    ref_table <- ref_table[!is.na(first_author_last_name) &
                           !is.na(first_author_first_initial) &
                           !is.na(year)
                         , .(first_author_last_name
                           , first_author_first_initial
                           , year
                           , citing_id = paper_id)]
    cit_table <- 
        merge(pub_table, ref_table
            , by = c("first_author_last_name"
                   , "first_author_first_initial"
                   , "year"), allow.cartesian = TRUE)
    cit_table <- cit_table[, .(citing_id, cited_id
                               ## , first_author_last_name
                               ## , first_author_first_initial
                               ## , year
                               )]
    disambr_add_set_attr(cit_table, ref_table
                       , name = "wos_tsv_author_year_citations"
                       , collection = "dyad_table"
                       , reference = "wos_tsv_publications")
    return(cit_table)
}
## --------<<  disambr_make_wos_tsv_author_year_citations:1 ends here


